"""
Вводится число 0 или 1, необходимо вывести 1 или 0 соответственно.

Формат ввода
Число 0 или 1.

Формат вывода
Число 0 или 1.

Тест 1
Входные данные:
0
Вывод программы:
1
"""
a = int(input())
if a == 0:
    print(1)
else:
    print(0)
