"""
Дано положительное двузначное число. Найдите число десятков в нем.

Формат ввода
Вводится единственное число (гарантируется, что оно соответствует условию задачи).

Формат вывода
Выведите ответ на задачу.

Тест 1
Входные данные:
42

Вывод программы:
4
"""
i = input()
print(i[0])