"""
Дано натуральное число. Выведите его последнюю цифру.

Формат ввода
Вводится единственное целое неотрицательное число (гарантируется, что оно не превышает 10000).

Формат вывода
Выведите ответ на задачу.

Тест 1
Входные данные:
179

Вывод программы:
9
"""
i = input()
print(i[-1])
