"""
Формат ввода
Вводится целое неотрицательное число N (N≤100).

Формат вывода
Выведите 2ᴺ.

Тест 1
Входные данные:
2
Вывод программы:
4
"""
i = int(input())
print(2**i)