"""
Дано трехзначное число. Найдите сумму его цифр.

Формат ввода
Вводится целое положительное число. Гарантируется, что оно соответствует условию задачи.

Формат вывода
Выведите ответ на задачу.

Тест 1
Входные данные:
179

Вывод программы:
17
"""
i = input()
print(int(i[0])+int(i[1])+int(i[2]))